app/views/search/check_availbility.html.erb

SELECT  "room_types".* FROM "room_types" WHERE "room_types"."id" = ? LIMIT 1  [["id", 1]]
SELECT "rooms".* FROM "rooms" WHERE ("rooms"."id" != 2) GROUP BY "rooms"."room_type_id"
---
        <td>
          <%= RoomType.find(room.room_type_id).name %>