app/controllers/bookings_controller.rb

  def index
    @bookings = Booking.where(user_id: current_user.id)
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ?  [["user_id", 1]]

  def create
    start_date = params[:start_date]
    end_date = params[:end_date]
    room_type = params[:room_type]
    if start_date == ''
      start_date = Date.today
    else
      start_date = Date.parse(start_date)
    end
    if end_date == ''
      end_date = start_date + 1.day
    else
      end_date = Date.parse(end_date)
    end
    @room_types = RoomType.all
    rooms = Room.all
    if room_type != ''
      rooms = rooms.rewhere(room_type_id: room_type)
    end
    room_ids = rooms.pluck(:id)
    occupied_count = Booking.where('start_date <= ? and end_date >= ?', start_date, end_date).rewhere(status_id: 1, room_id: room_ids)
    if rooms.count > occupied_count.count
---
SELECT "room_types".* FROM "room_types"
SELECT "rooms"."id" FROM "rooms" WHERE "rooms"."room_type_id" = ?  [["room_type_id", 1]]
SELECT "bookings"."room_id" FROM "bookings" WHERE (start_date <= '2018-05-26' and end_date >= '2018-05-31') AND "bookings"."status_id" = ? AND "bookings"."room_id" IN (1, 2)  [["status_id", 1]]
SELECT COUNT(*) FROM "bookings" WHERE (start_date <= '2018-05-26' and end_date >= '2018-05-31') AND "bookings"."status_id" = ? AND "bookings"."room_id" IN (1, 2)  [["status_id", 1]]
SELECT COUNT(*) AS count_all, "rooms"."room_type_id" AS rooms_room_type_id FROM "rooms" WHERE "rooms"."room_type_id" = ? AND ("rooms"."id" != 2) GROUP BY "rooms"."room_type_id"  [["room_type_id", 1]]


    respond_to do |format|
      if @rooms.count > 0
        @booking = Booking.create(user: current_user, start_date: start_date, end_date:end_date, room: @rooms.first, status_id: 1)
---
INSERT INTO "bookings" ("user_id", "start_date", "end_date", "status_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["start_date", "2018-05-26"], ["end_date", "2018-05-31"], ["status_id", 1], ["created_at", "2018-05-11 14:18:19.591660"], ["updated_at", "2018-05-11 14:18:19.591660"]]