app/controllers/home_controller.rb

SELECT "room_types".* FROM "room_types"
---
  def index
    @room_types = RoomType.all