app/controllers/search_controller.rb

SELECT "room_types".* FROM "room_types"
SELECT "rooms".* FROM "rooms" WHERE (1=1)
SELECT "rooms"."id" FROM "rooms" WHERE "rooms"."room_type_id" IS NULL
SELECT "bookings"."room_id" FROM "bookings" WHERE (start_date <= '2018-05-31' and end_date >= '2018-06-01') AND "bookings"."status_id" = ? AND "bookings"."room_id" IN (1, 2)  [["status_id", 1]]
SELECT COUNT(*) FROM "bookings" WHERE (start_date <= '2018-05-31' and end_date >= '2018-06-01') AND "bookings"."status_id" = ? AND "bookings"."room_id" IN (1, 2)  [["status_id", 1]]
SELECT COUNT(*) AS count_all, "rooms"."room_type_id" AS rooms_room_type_id FROM "rooms" WHERE (1=1) GROUP BY "rooms"."room_type_id"
---
  def check_availbility
    start_date = params[:start_date]
    end_date = params[:end_date]
    room_type = params[:room_type]
    # binding.pry
    if start_date == ''
      start_date = Date.today
    else
      start_date = Date.parse(start_date)
    end
    if end_date == ''
      end_date = start_date + 1.day
    else
      end_date = Date.parse(end_date)
    end
    @room_types = RoomType.all
    rooms = Room.all
    if room_type != ''
      rooms = rooms.rewhere(room_type_id: room_type)
    end
    room_ids = rooms.pluck(:id)
    occupied_count = Booking.where('start_date <= ? and end_date >= ?', start_date, end_date).rewhere(status_id: 1, room_id: room_ids)
    if rooms.count > occupied_count.count